app/views/layouts/common/_recent_users.html.erb

			<h5 class="form-heading">Recent Users</h5>
			<% @recent_users = User.order(:created_at).limit(10).all %>
---
SELECT "users".* FROM "users" ORDER BY created_at LIMIT 10