app/controllers/tweets_controller.rb

  def index

    @user = User.find_by_username(params[:username])

    if @user
      @tweets = @user.tweets.limit(10)
---
SELECT "users".* FROM "users" WHERE "users"."username" = 'sunithakmenon' LIMIT 1
SELECT "tweets".* FROM "tweets" WHERE "tweets"."user_id" = 10 LIMIT 10
SELECT "users".* FROM "users" ORDER BY created_at LIMIT 10

  def edit
    @tweet = Tweet.find(params[:id])
---
SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = ? LIMIT 1  [["id", "1"]]

  def create

    @tweet = Tweet.new(params[:tweet])
    @tweet.user = current_user

    respond_to do |format|
      if @tweet.save
---
INSERT INTO "tweets" ("created_at", "message", "private", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Sun, 16 Dec 2012 13:09:03 UTC +00:00], ["message", "My First Tweet"], ["private", false], ["updated_at", Sun, 16 Dec 2012 13:09:03 UTC +00:00], ["user_id", 10]]

  def update

    @tweet = Tweet.find(params[:id])

    respond_to do |format|
      if @tweet.update_attributes(params[:tweet])
---
SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "tweets" SET "message" = 'My First Tweet - Modified', "updated_at" = '2012-12-16 13:52:17.829524' WHERE "tweets"."id" = 1