app/controllers/welcome_controller.rb

  def home
    if signed_in?
      @tweets = Tweet.where("user_id != #{current_user.id}").order("created_at desc").limit(30).all
    else
      @tweets = Tweet.order("created_at desc").limit(30).all
---
SELECT "tweets".* FROM "tweets" ORDER BY created_at LIMIT 30